Revit 2027 API
Dimension.Curve Property
 A curve that represents the dimension line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
public:
property Curve^ Curve {
	Curve^ get ();
}
member Curve : Curve with get
Property Value
Curve
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace